# load extension

In [2]:
%reload_ext mysqlmagic

# set database configs

In [3]:
%%configs
{
    "user": "root",
    "password": "admin",
    "host": "127.0.0.1",
    "port": 13306
}

Connect to the database successfully! The database version is 8.0.26

In [4]:
%%mysql
USE PEOPLE;

0

# select

In [5]:
%%mysql -v query_results -f query_results.csv
SELECT *
FROM EMPLOYEE;

In [6]:
query_results

  FIRST_NAME LAST_NAME  AGE SEX  INCOME
0        Mac     Mohan   21   M  2000.0

# insert

In [6]:
%%mysql
INSERT INTO EMPLOYEE(FIRST_NAME, LAST_NAME, AGE, SEX, INCOME)
VALUES ('Jack', 'Ma', 50, 'M', 20000000)

1

In [7]:
%%mysql
SELECT *
FROM EMPLOYEE;

# update

In [8]:
%%mysql
UPDATE EMPLOYEE
SET INCOME = 200000
WHERE FIRST_NAME = 'Jack' AND LAST_NAME = 'Ma';

1

In [9]:
%%mysql
SELECT *
FROM EMPLOYEE;

# delete

In [10]:
%%mysql
DELETE 
FROM EMPLOYEE
WHERE FIRST_NAME = 'Jack' AND LAST_NAME = 'Ma';

1

In [11]:
%%mysql
SELECT *
FROM EMPLOYEE;

In [7]:
%%mysql?